// pages/amimalDetail/animalDetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    name:"阿龙",
    sex:"男",
    specie:"鳄鱼",
    birthday: "",
    workTime: "全天",
    workExpe: "",
    funStory: "",
    animalIndex: 0,
    allAnimalInformation: [
      {
        name:"西施惠",
        sex:"女",
        specie:"狗",
        birthday: "12月20日",
        workTime: "全天",
        workExpe: "无人岛公所兢兢业业的职员，全天候上班",
        funStory: "西施惠从小就与弟弟西施德住在一起，虽然西施惠在人们眼中一直都是温柔的样子，但她弟弟对她的评价却是“挺叛逆的”。\n根据西施惠自己透露，她实际上是近视的，而在平时工作中会戴隐形眼镜。她偶尔会去旅行，并且“方向感很差”，甚至会在市政厅前迷路。"
      },
      {
        name: "狸克",
        sex: "男",
        specie: "浣熊",
        birthday: "5月30日",
        workTime: "全天",
        workExpe: "狸克作为无人岛的创始人之一，会在玩家刚刚登上无人岛时对玩家进行引导，平时玩家可以在无人岛的服务中心找狸克办理各种服务，包括建造房屋、建造桥梁和坡道、更改基础设置以及房屋建设等。",
        funStory :"狸克创办的狸克公司，主导了游戏中的无人岛开荒计划，让玩家有机会开始新的旅程。狸克一直以乐善好施的商人形象示人，他将自己的大部分盈利都捐给了慈善机构。"
      },
      {
        name:"豆狸&粒狸",
        sex: "男",
        specie :"浣熊",
        birthday: "6月7日",
        workTime: "商店开张前全天，商店开张后每天8:00-12:00",
        workExpe: "豆狸和粒狸最早是狸克的小助手，在无人岛的商店开张后，兄弟俩在商店找到一份兼职，玩家可以找他们收购道具以及购买大头菜。",
        funStory: "豆狸和粒狸是狸克的侄子。可爱的外形以及活泼的性格让他们俩收到了全体岛民的一致喜爱。",
      },
      {
        name: "傅达",
        sex: "男",
        specie: "猫头鹰",
        birthday: "9月24日",
        workTime: "全天",
        workExpe: "傅达是一位声名远播的古生物学家，在玩家收集到15种不同的展品后，傅达会帮助玩家建造博物馆并担任馆长一职。傅达还会好心的帮助玩家鉴定发掘出的化石",
        funStory: "作为一只猫头鹰，傅达却对昆虫类的生物有着莫名的厌恶。 作为一名名声赫赫的古生物学家，傅达对化石以及鱼类生物有着很深的研究，他的梦想是有朝一日能在博物馆展出雷龙化石。 唯一的缺点是总是让人问一句答十句。",
      },
      {
        name: "傅珂",
        sex: "女",
        specie: "猫头鹰",
        birthday: "9月7日",
        workTime: "流星雨夜晚的19:00-4:00",
        workExpe: "只有在流星雨的夜晚才会出现的神秘少女，玩家可以与她对话，慷慨的她会赠予玩家各种各样的设计图，前两次固定获得星星棒以及当日星座的设计图，之后获取的设计图完全随机。",
        funStory: "除了知道她是博物馆馆长傅达的妹妹之外，人们对这位神秘少女一无所知。只能从她慷慨赠送的设计图推测这是一位对星空有着无限热爱的设计师。",
      },
      {
        name: "幽幽",
        sex: "男",
        specie: "幽灵",
        birthday: "2月26日",
        workTime: "每天20:00-5:00",
        workExpe: "作为一只幽灵，幽幽每天仅仅会在入夜后在山上游荡，他应该就是岛民们说的“无业游民”吧。",
        funStory: "虽然身为一只幽灵，但胆小的幽幽竟然会被路上偶遇的玩家吓的魂飞魄散。当他终于冷静下来，会请求玩家帮忙把在全岛跑来跑去的他的五个魂魄抓回来，作为回报，他会赠与玩家“未拥有的东西”或是“有点贵的东西”。",
      },
      {
        name: "K.K.",
        sex: "男",
        specie: "狗",
        birthday: "8月23日",
        workTime: "每周六5:00-24:00",
        workExpe: "无人岛最受欢迎的歌手，每周六晚上都会在“鸽子之巢”开一场演唱会，还会随机赠送专辑给现场观众。",
        funStory: "K.K.无疑是无人岛上的一个传奇，虽然他只会在每周六来到无人岛开演唱会，但是他帅气的外表以及动人的歌声还是征服了大部分岛民，他的所有演唱会无一不是座无虚席。据说K.K.对于开演唱会的环境身份挑剔，所以他直有在岛屿的评分达到三星级之后才会来到岛上。",
      },
      {
        name: "薛革",
        sex: "男",
        specie: "臭鼬",
        birthday: "11月30日",
        workTime: "周一至周五随机一天的5:00-24:00",
        workExpe: "无人岛鞋子和包包的指定供货商，每周只有一天会在服务中心门口摆摊，售卖高质量的鞋袜还有包包。",
        funStory: "薛革无疑是一位出色又负责任的商人，他的商品受到无人岛几乎所有岛民的称赞。同时薛革也恪守着“生活与生意严格分开”的原则，人们对他的印象仅停留在他所出售的高质量的商品。",
      },
      {
        name: "巴猎",
        sex: "男",
        specie: "狗",
        birthday: "8月2日",
        workTime: "全天",
        workExpe: "来自巴猎岛的摄影师，负责摄影棚的管理工作。玩家可以找他租借摄影棚以及学习摄影技巧。",
        funStory: "摄影师巴猎来自遥远的巴猎岛，在无人岛相遇后，他会热情邀请玩家去巴猎岛做客。尽管路途遥远，巴猎还是凭借着他高超的摄影技巧成为了岛民们拍照的首选。",
      },
      {
        name: "麻儿",
        sex: "女",
        specie: "刺猬",
        birthday: "11月22日",
        workTime: "9:00-21:00",
        workExpe: "麻儿和她的姐妹们一起经营着无人岛上的“ABLE SISTERS”服装店，麻儿负责服装店制作，裁改衣服的工作",
        funStory: "作为刺猬三姐妹中的大姐，麻儿默默承担着照顾两位妹妹的责任，她默默承担着服装店经营中最大的工作。她精细的服装手艺让服装店几乎每一位顾客都赞不绝口。",
      },
      {
        name: "绵儿",
        sex: "女",
        specie: "刺猬",
        birthday: "10月31日",
        workTime: "周一至周五随机时间",
        workExpe: "“ABLE SISTERS”服装店的服装设计师，不定期的会寻找服装店顾客来帮助她搭配服饰、寻找当季时尚灵感，在完成后也会给予一些回报。",
        funStory: "绵儿是刺猬三姐妹的二姐，也是岛上十分受人欢迎的服装设计师，她日常的服装搭配是岛上人人效仿的范本。据服装店的顾客们表示，绵儿经常会待在服装店后面的小屋子里，琢磨下一季的服饰设计方案，很难在店里见到她的身影。",
      },
      {
        name: "绢儿",
        sex: "女",
        specie: "刺猬",
        birthday: "5月22日",
        workTime: "9:00-21:00",
        workExpe: "“ABLE SISTERS”服装店的店员，负责服装店的销售工作。",
        funStory: "娟儿是刺猬三姐妹的小妹，她活泼可爱的性格以及热情的服务态度无疑为服装店吸引来了许多回头客。如果不知道要买些什么衣服，可以去问问娟儿，她似乎对服装搭配也有着一些独到的见解，常常会给出一些不错的建议。",
      },
      {
        name: "然然",
        sex: "男",
        specie: "树懒",
        birthday: "8月8日",
        workTime: "周一至周五随机一天的5:00-22:00",
        workExpe: "无人岛唯一花匠，每周会有一天摆摊，向玩家出售花丛种子和花朵种子。",
        funStory: "据知情人透露，然然的生活中是两件头等大事，一是睡觉，二是照顾他的宝贝花朵。每周仅仅有一天他能抽出时间来向大家出售他的宝贝种子，他还会再三叮嘱买家小心呵护这些娇贵的宝贝们。",
      },
      {
        name: "狐利",
        sex :"男",
        specie :"狐狸",
        birthday :"10月18日",
        workTime :"5:00-次日5:00",
        workExpe: "不定期出现在无人岛上的小商贩，向岛民出售艺术品和小物件。",
        funStory: "据说狐利先生一直将狸克视为自己的头号竞争对手，所以他才会不定期出现在无人岛上低价出售自己的艺术品以及小物件。但是说实在的，狐利先生的外表不可避免地让在他那里买东西的人感到不太放心。一位不愿意透露姓名的岛民表示自己在狐利先生那里买来的艺术都是假货。",
      },
      {
        name: "骆岚",
        sex :"男",
        specie :"骆驼",
        birthday :"11月10日",
        workTime :"5:00-24:00,周一至周五随机出摊",
        workExpe: "周一至周五不定期出现的地毯商人，在他这里可以找到最好看的地毯和壁纸。",
        funStory: "骆岚先生所出售的地毯以及壁纸样式似乎是固定不变的，正如他本人给人的印象一样——沉稳。当你向他购买了五张地毯后，他会赠送你一块很罕见的壁纸或地毯。",
      },
      {
        name: "吕游",
        sex :"男",
        specie :"海鸥",
        birthday :"5月25日",
        workTime :"5:00-次日5:00",
        workExpe: "水手，大部分时间都在大海上度过，玩家很少会在岛上遇到他。",
        funStory: "提到吕游，大部分的岛民都是啼笑皆非的样子，因为人们不止一次发现他不小心掉下船，昏迷后被海浪冲到沙滩上。如果你碰巧在海滩上遇到了昏迷的吕游，一定要持续与他对话知道他完全清醒，请帮助他在沙滩上寻找散落的通讯零件，吕游会邮寄纪念品作为报答。",
      },
      {
        name: "俞司廷",
        sex :"男",
        specie :"海狸",
        birthday :"3月7日",
        workTime :"5:00-次日5:00,周一至周五随机出现",
        workExpe: "无人岛钓鱼比赛主持人。",
        funStory: "你很难再找到像余思廷一样对鱼类有莫大的喜爱的人了。他继承父业成为了无人岛的钓鱼比赛主持人，在业余时间，他还会在网上进行直播，具体的直播内容似乎大家都不太懂，但是大家一致赞同他是个“网红”。人会是不是看到余思廷在码头高价回收各种鱼类，帮助人们制作各种鱼类标本。",
      },
      {
        name: "龙克斯",
        sex :"男",
        specie :"变色龙",
        birthday :"5月10日",
        workTime :"5:00-次日5:00",
        workExpe: "未知，似乎是昆虫学家？",
        funStory: "在无人岛的居民眼中，龙克斯应该是一个不折不扣的“怪人”了，你经常可以看到他拿着捕虫网趴在地上抓虫子，一抓就是一整天。他还会以高于市场价的价格收购玩家手里的虫子。如果你愿意赠送他两只虫子作为报酬的话，他会帮你把一只虫子制作成标本。",
      },
      {
        name: "曹卖",
        sex :"女",
        specie :"猪",
        birthday :"5月5日",
        workTime :"周日5:00-12:00",
        workExpe: "每周日早上都会按时来到无人岛售卖大头菜",
        funStory: "为了照顾年老的祖母，曹卖主动代替祖母承担了每周日来无人岛售卖大头菜的任务。她的出场造型十分的奇特，较小的少女头顶着一大筐大头菜出现在人们的视线中，让人们不禁好奇这样真的头不会痛么？",
      },
      {
        name: "莫里",
        sex :"男",
        specie :"渡渡鸟",
        birthday :"10月2日",
        workTime :"全天",
        workExpe: "渡渡鸟航空公司空少，同时也负责机场其他事务以及明信片邮寄",
        funStory: "莫里还有他的兄弟陆德里一起因为工作原因搬来无人岛，可能是由于航空公司的任务比较繁忙吧，兄弟俩几乎不怎么跟其他居民打交道。",
      },
      {
        name: "陆德里",
        sex :"男",
        specie :"渡渡鸟",
        birthday :"11月17日",
        workTime :"全天",
        workExpe: "渡渡鸟航空公司飞行员",
        funStory: "与他的兄弟莫里不同，陆德里飞行员的身份注定了无人岛居民们见到他的次数屈指可数。若不是莫里主动提起的话，大家说不定都不知道陆德里也居住在无人岛上。",
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    var app = getApp();
    var index = app.globalData.animalIndex;
    this.setData({
      animalIndex: index,
      name: this.data.allAnimalInformation[index].name,
      sex: this.data.allAnimalInformation[index].sex,
      specie: this.data.allAnimalInformation[index].specie,
      birthday: this.data.allAnimalInformation[index].birthday,
      workTime: this.data.allAnimalInformation[index].workTime,
      workExpe: this.data.allAnimalInformation[index].workExpe,
      funStory: this.data.allAnimalInformation[index].funStory
    });
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})